// РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________
//
// 1. Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
// За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.

let str='Привіт';
let num=123;
let flag=true;
let txt='true';
console.log('змінна str - тип: '+typeof(str));
console.log('змінна num - тип: '+typeof(num));
console.log('змінна flag- тип: '+typeof(flag));
console.log('змінна txt - тип: '+typeof(txt));

// 2. Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних операцій отримайте числа:
//         34,
//         12,
//         66,
//         90,
//         87
// Старайтесь використовувати різні оператори.
//     Example: 88 = (16 / 2) * 11

let a1;
let a2;
let a3;
let a4;
let a5;
a1=15*2+4;
a2=15*4/5;
a3=(77-15)+4;
a4=(150/3+40);
a5=17+140/2;
console.log('a1='+a1);
console.log('a2='+a2);
console.log('a3='+a3);
console.log('a4='+a4);
console.log('a5='+a5);


// 3.  Створітьзмінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
//     5 % 3,
//     3 % 5,
//     5 + '3',
//     '5' - 3,
//     75 + 'кг'

let a6=2;
let a7=3;
let a8=53;
let a9=2;
let a10='75кг';
console.log('a6='+a6);
console.log('a7='+a7);
console.log('a8='+a8);
console.log('a9='+a9);
console.log('a10='+a10);


// 4. Напищіть код, який вираховує площу прямокутника висотою 23см.
// (змінна height) та шириною 10см (змінна width).
//     Значеня площі зберігати в змінній s.
let height=23;
let width=10
let s=height*width;
console.log('площа прямокутника s= '+s+' кв.см')

// 5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC)
// и диаметром основания 4м (dC),
//     результат поместите в переменную v.
let heightC=10;
let dC=4;
// V=pi*(r**2)*h
let v=3.14*((4/2)**2)*10;
console.log('обєм циліндра v= '+v+" кв.м.");

// 6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
// Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень)
// или оператор возведения в степень ** ).
// c**2=a**2+b**2
let n=3;
let m=4;
let k=Math.sqrt(3**2+4**2);
console.log('довжина гіпотенузи k='+k);

//2.варіант
let n2=3;
let m2=4;
let k2=Math.sqrt(Math.pow(n2,2)+Math.pow(m2,2));
console.log('довжина гіпотенузи k2='+k2);

// 7. Напишите скрипт, который выводит "Hello world", создавши переменную str
// и выводить спомощью document.write, alert и console.log
let strH='Hello World!';
document.write(strH);
alert(strH);
console.log(strH);
document.write('<br/>');

// 8. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби
// (каждой на новой строки спомощью \n).
alert ( 'Бігун Валерій Павлович\n вік: 37 років\n хоббі: програмування');

// 9. Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//     Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//     Вывести в документ содержимое переменной concatenation с помощью document.write
let str1='Кто ';
let str2='ты ';
let str3='такой?';
let concatenation=str1+str2+str3;
document.write(concatenation);
document.write('<br/>');

// 10. Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
//   let str4 = "20";
//  let a = 5;

// document.write(str4 + a + "<br/>");// - выведет 205 ,так как выполняется конкатенация строк
// document.write(str4-a + "<br/>");// -- выведет 15,  так как  в этом случае "20"-преобразуется в число.
//
//   document.write(str3 * "2" + "<br/>"); -выведет NaN--так як  Результат Будь-якої операції, що містить рядок та не є операцією додавання-
//   document.write(str3 / 2 + "<br/>");   -выведет NaN--так як Результат Будь-якої операції, що містить рядок та не є операцією додавання

// 11. Какие значения выведет в окно консоли следующий фрагмент кода если его поместить в console.log?
// parseInt("3.14" )  -- выведет 3
// parseInt("-7.875") -- выведет -7
// parseInt("435") -- выведет 435
// parseInt("Вася") -- выведет  NaN  -
// Функция parseInt() принимает строку в качестве аргумента и возвращает целое число в соответствии с указанным основанием системы счисления.
// Если первый символ не получилось сконвертировать в число, то возвращается NaN.

// 12.  С помощью окна ввода, вызываемого методом prompt, пользователь может ввести данные,
// которые будут использоваться далее, повторите код ниже

// let str = prompt("Enter something", "ho-ho")
// console.log(str);
//
let str5 = prompt("Enter something", "ho-ho")
 console.log(str5);


// 13. С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert
let num1=prompt('введіть  перше число');
let num2=prompt('введіть друге число');
alert('(num1+num2)='+(parseInt(num1)+parseInt(num2)),'');

// 14. С помощью окна ввода, вызываемого методом prompt,
// пользователь последовательно выводит имя, фамилию и возраст,
// а вам не обходимо вывести строку такого вида
// Доброго вечера Иван Иванов, мои поздравления что вам 32 ,
// а вывод результата при помощи метода alert

let userName=prompt( 'Введіть ПІБ');
let userAge=prompt('Введіть свій вік');
alert(`Доброго вечера ${userName}, мои поздравления что Вам ${userAge}`);

